Repository: MatinXastan/crystal-Vpn
Catalog: lib/l10n/app_*.arb
Languages: fa, tr

source: Crystal VPN
fa: کریستال وی پی ان

source: Super App
fa: سوپر اپلیکیشن
tr: Süper Uygulama

# version
source: Version 1.0.0
fa: نسخه ۱.۰.۰
tr: Sürüm 1.0.0

source: Terms and Conditions
fa: قوانین و مقررات
tr: Şartlar ve Koşullar

# configSourceInfo
source: We have collected the best possible free configs from public sources.
fa: بهترین کانفیگ‌های رایگان ممکن را از منابع عمومی گردآوری کردیم.
tr: Kamuya açık kaynaklardan mümkün olan en iyi ücretsiz yapılandırmaları topladık.

# illegalUseWarning
source: Using this app for illegal purposes is prohibited.
fa: استفاده از این برنامه برای مقاصد غیرقانونی ممنوع است.
tr: Bu uygulamanın yasadışı amaçlarla kullanılması yasaktır.

# sensitiveUseWarning
source: Do not use these configs for sensitive tasks (e.g., banking).
fa: از کانفیگ‌ها برای کارهای حساس (مانند امور بانکی) استفاده نکنید.
tr: Yapılandırmaları hassas işlemler (örn. bankacılık) için kullanmayın.

# acceptTerms
source: I have read and accept the terms
fa: قوانین را مطالعه کرده و می‌پذیرم
tr: Şartları okudum ve kabul ediyorum

source: Start
fa: شروع کنید
tr: Başla

# autoRedirectMsg
source: You will be redirected in 10 seconds if no selection is made.
fa: پس از ۱۰ ثانیه در صورت عدم انتخاب، به صفحه بعدی منتقل می‌شوید.
tr: Seçim yapılmazsa 10 saniye içinde yönlendirileceksiniz.

# errorLabel
source: Error:
fa: خطا:
tr: Hata:

# countLabel
source: Count:
fa: تعداد:
tr: Sayı:

source: All Configs
fa: همه کانفیگ‌ها
tr: Tüm Yapılandırmalar

# findNewConfigs
source: Click to find new configs
fa: برای یافتن کانفیگ‌های جدید کلیک کنید
tr: Yeni yapılandırmalar bulmak için tıklayın

# reciveConfigs
source: Receive Configs
fa: دریافت کانفیگ ها
tr: Yapılandırmaları Al

# pingWaitMsg
source: Please wait for the ping test to finish.
fa: لطفاً تا پایان عملیات تست پینگ صبر کنید.
tr: Lütfen ping testi bitene kadar bekleyin.

# retestNeededMsg
source: Configs need retesting. Ping test starting.
fa: کانفیگ‌ها نیاز به تست مجدد دارند. تست پینگ شروع می‌شود.
tr: Yapılandırmaların tekrar test edilmesi gerekiyor. Ping testi başlıyor.

source: Best config selected
fa: بهترین کانفیگ انتخاب شد
tr: En iyi yapılandırma seçildi

source: Auto Select
fa: انتخاب خودکار
tr: Otomatik Seçim

source: Stop
fa: توقف
tr: Durdur

source: Test
fa: تست

# selectConfigMsg
source: Select a config from the list
fa: یک کانفیگ را از لیست انتخاب کنید
tr: Listeden bir yapılandırma seçin

# alreadyConnectedMsg
source: Connecting or already connected.
fa: در حال اتصال یا متصل است.
tr: Bağlanıyor veya zaten bağlı.

# invalidConfigMsg
source: Selected config is invalid.
fa: کانفیگ انتخاب شده نامعتبر است.
tr: Seçilen yapılandırma geçersiz.

# v2rayErrorMsg
source: Error starting V2Ray:
fa: خطا در شروع V2Ray:
tr: V2Ray başlatma hatası:

source: Selected Server
fa: سرور انتخاب شده
tr: Seçilen Sunucu

source: Select Config
fa: انتخاب کانفیگ
tr: Yapılandırma Seç

source: Connection Status
fa: وضعیت اتصال
tr: Bağlantı Durumu

source: Protocol:
fa: پروتکل:
tr: Protokol:

source: Error
fa: خطا
tr: Hata

source: Unknown
fa: نامشخص
tr: Bilinmiyor

source: Location
fa: مکان
tr: Konum

source: Refresh Location
fa: بروزرسانی مکان
tr: Konumu Yenile

source: Uptime
fa: مدت زمان اتصال
tr: Çalışma Süresi

source: My Information
fa: اطلاعات من
tr: Bilgilerim

# telegramItem
source: Telegram Channel
fa: کانال تلگرام
tr: Telegram Kanalı

source: My Telegram Channel
fa: کانال تلگرام من
tr: Telegram Kanalım

# githubItem
source: GitHub
fa: گیت‌هاب

source: My GitHub
fa: گیت‌هاب من
tr: GitHub Hesabım

# projectItem
source: Project
fa: پروژه
tr: Proje

source: Project Address
fa: آدرس پروژه
tr: Proje Adresi

source: Error receiving configs
fa: خطا در دریافت کانفیگ
tr: Yapılandırma alma hatası

source: Retry
fa: تلاش مجدد
tr: Tekrar Dene

# pleaseSelectLanguage
source: Please select your language
fa: لطفا زبان خود را انتخاب کنید
tr: Lütfen dilinizi seçin

source: Choose your language
fa: زبان خود را انتخاب کنید
tr: Dilinizi seçin

# tutorialTitle
source: Usage Tutorial
fa: آموزش استفاده
tr: Kullanım Eğitimi

# watchVideo
source: Watch the video
fa: ویدیو را مشاهده کنید
tr: Videoyu izle

# videoSeenAndUnderstood
source: I watched and understood
fa: ویدیو را دیدم و متوجه شدم
tr: İzledim ve anladım

# continueAction
source: Continue
fa: ادامه
tr: Devam Et

source: Loading Error
fa: خطا در بارگذاری
tr: Yükleme Hatası
